name: "splade"
backend: "python"
max_batch_size: 32

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "INDICES"
    data_type: TYPE_INT32
    dims: [-1]
  },
  {
    name: "VALUES"
    data_type: TYPE_FP32
    dims: [-1]
  }
]

parameters: {
  key: "EXECUTION_ENV_PATH"
  value: { string_value: "$$TRITON_MODEL_DIRECTORY/splade_env.tar.gz" }
}